import RFSE
import MOSC


#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

class Agilent34401A:

    def __init__(self):
        self.IsAutomatic = False

#######################################################################################################################
#######################################  Agilent34401A CHOICE CONNECTED  ##############################################
#######################################################################################################################
    def Choice_Connected(self) -> str:

        type_connected = RFSE.Messenger("get", "Выберите способ подключения AGILENT34401A#@agilent34401a",
                                            "Пожалуйста, выберите тип настройки прибора Agilent34401A\n"
                                            "Внимание. Выбирая режим симуляции, "
                                            "вы запускаете все измерения в режиме симуляции!!!",
                                            "choice=Автоматически;Вручную")

        RFSE.Stage(" ")
        return type_connected

#######################################################################################################################
#########################################  Agilent34401A Initialization  ##############################################
#######################################################################################################################

    def Initialization(self, init: bool = True):

        type_setting_agilent = self.Choice_Connected()

        RFSE.Report("TYPE_SETTING_AGILENT34401A", "info", "string", "Тип настройки прибора")

        match type_setting_agilent:
            case 'Автоматически':
                self.IsAutomatic = True
                RFSE.Report("TYPE_SETTING_AGILENT34401A", "set", 'string', 'Автоматически')
            case "Вручную":
                self.IsAutomatic = False
                RFSE.Report("TYPE_SETTING_AGILENT34401A", "set", 'string', 'Вручную')

        self.SET_TIMEOUT()
        self.SET_RESET()

#######################################################################################################################

        if init:
            if self.IsAutomatic:
                MOSC.hash_passed()
            else:
                MOSC.hash_failed()

#######################################################################################################################
##########################################  Agilent34401A Init device  ################################################
#######################################################################################################################

    def INIT_DEVICE(self) -> str:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: init >> команда: ', 'driver')
            return "connected"
        else:
            RFSE.Messenger("set", "Произведите настройки Agilent34401A#@agilent34401a",
                           "Произведите настройки:\nВключите прибор\nНажмите OK")

            return "connected"

#######################################################################################################################
##########################################  Agilent34401A SET TIMEOUT  ################################################
#######################################################################################################################

    def SET_TIMEOUT(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: Timeout = 10000', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки Agilent34401A#@agilent34401a",
                           "Произведите настройки:\nСброс\nНажмите OK")

#######################################################################################################################
############################################  Agilent34401A SET RESET  ################################################
#######################################################################################################################

    def SET_RESET(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: Reset', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки Agilent34401A#@agilent34401a",
                           "Произведите настройки:\nУстановите Timeout = 10000\nНажмите OK")

#######################################################################################################################
#############################################  Agilent34401A SET FUNC  ################################################
#######################################################################################################################

    def SET_FUNC(self, WireConnection: str) -> None:
        if self.IsAutomatic:
            RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: func = {WireConnection} ', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Agilent34401A#@agilent34401a',
                           f'Произведите настройки:\nУстановите func = {WireConnection}\nНажмите OK')

#######################################################################################################################
#############################################  Agilent34401A SET NPLC  ################################################
#######################################################################################################################

    def SET_NPLC_100(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: NPLC = 100 ', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Agilent34401A#@agilent34401a',
                           f'Произведите настройки:\nУстановите NPLC = 100\nНажмите OK')

#######################################################################################################################
#############################################  Agilent34401A SET RES  #################################################
#######################################################################################################################

    def SET_RES_MIN(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: RES = MIN ', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Agilent34401A#@agilent34401a',
                           'Установите разрешение = MIN;\nНажмите OK')

#######################################################################################################################
############################################  Agilent34401A SET BAND  #################################################
#######################################################################################################################

    def SET_BAND_MIN(self) -> None:

        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: BAND = 3 ', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Agilent34401A#@agilent34401a',
                           'Установите фильтр на 3 Гц;\nНажмите OK')

#######################################################################################################################
###########################################  Agilent34401A SET RANGE  #################################################
#######################################################################################################################
    def SET_RANGE(self, range: (str | float | int)) -> None:

        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: range = {range}', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки на Agilent34401A#@agilent34401a",
                           f"Произведите настройки:\nУстановите диапазон = {range}\nНажмите OK")

#######################################################################################################################
##########################################  Agilent34401A SET AUTOZERO  ###############################################
#######################################################################################################################
    def SET_AUTOZERO_ONCE(self) -> None:

        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: AUTOZERO = ONCE', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Agilent34401A#@agilent34401a',
                           'Установите разрешение до 4-го знака после запятой;\nНажмите OK')

#######################################################################################################################
##########################################  Agilent34401A READ RESULT  ################################################
#######################################################################################################################
    def Read_Result(self, verified: (int, float)) -> (str, int, float):

        if self.IsAutomatic:
            RFSE.Stage('Драйвер: AgilentDMM >> режим: get >> команда: result = read', 'driver')
            result = verified
        else:
            result = RFSE.Messenger("get", "Введите результат#@notes",
                                    "Введите измеренный результат с Agilent34401A\nНажмите OK", "string")
        RFSE.Stage(" ")
        return result
