import RFSE
import MOSC


#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

class Fluke5520A:

    def __init__(self):
        self.IsSimulation = False
        self.IsAutomatic = False

#######################################################################################################################
#########################################  Fluke5520A CHOICE CONNECTED  ###############################################
#######################################################################################################################

    def Choice_Connected(self) -> str:

        type_connected = RFSE.Messenger("get", "Выберите способ подключения Fluke5520A#@fluke5520a",
                                            "Пожалуйста, выберите тип настройки прибора Fluke5520A\n"
                                            "Внимание. Выбирая режим симуляции, "
                                            "вы запускаете все измерения в режиме симуляции!!!",
                                            "choice=Автоматически;Вручную")

        RFSE.Stage(" ")
        return type_connected

#######################################################################################################################
############################################  Fluke5520A Initialization  ##############################################
#######################################################################################################################

    def Initialization(self, init: bool = True) -> None:

        type_setting_fluke = self.Choice_Connected()

        RFSE.Report("TYPE_SETTING_FLUKE5520A", "info", "string", "Тип настройки прибора")

        match type_setting_fluke:
            case 'Автоматически':
                self.IsAutomatic = True
                RFSE.Report("TYPE_SETTING_FLUKE5520A", "set", 'string', 'Автоматически')
            case "Вручную":
                self.IsAutomatic = False
                RFSE.Report("TYPE_SETTING_FLUKE5520A", "set", 'string', 'Вручную')

        self.SET_TIMEOUT()
        self.SET_RESET()

#######################################################################################################################

        if init:
            if self.IsAutomatic:
                MOSC.hash_passed()
            else:
                MOSC.hash_failed()

#######################################################################################################################
############################################  Fluke5520A Init device   ################################################
#######################################################################################################################

    def INIT_DEVICE(self) -> str:
        if self.IsSimulation:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: init >> команда: ', 'driver')
            return "connected"
        elif self.IsAutomatic:
            return RFSE.Driver('Fluke5000', 'init', '')
        else:
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                           "Произведите настройки:\nВключите прибор\nНажмите OK")

            return "connected"

#######################################################################################################################
#############################################  Fluke5520A SET TIMEOUT  ################################################
#######################################################################################################################

    def SET_TIMEOUT(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Timeout = 10000', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                           "Произведите настройки:\nСброс\nНажмите OK")

#######################################################################################################################
###############################################  Fluke5520A SET RESET  ################################################
#######################################################################################################################

    def SET_RESET(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Reset', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                           "Произведите настройки:\nУстановите Timeout = 10000\nНажмите OK")

#######################################################################################################################
############################################   Fluke5520 SET OUT = AUX   ##############################################
#######################################################################################################################

    def SET_OUT_AUX(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: OUT = AUX', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                           'Произведите настройки:\nУстановите OUT = AUX\nНажмите OK')

#######################################################################################################################
############################################   Fluke5520 SET OUT = NORMAL   ###########################################
#######################################################################################################################

    def SET_OUT_NORMAL(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: OUT = NORMAL', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                           'Произведите настройки:\nУстановите OUT = NORMAL\nНажмите OK')

#######################################################################################################################
############################################   Fluke5520 SET Conn = 4w  ###############################################
#######################################################################################################################

    def SET_CONN_4W(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Conn = 4w', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                           'Произведите настройки:\nУстановите Conn = 4w\nНажмите OK')

#######################################################################################################################
############################################   Fluke5520 SET Conn = NO  ###############################################
#######################################################################################################################

    def SET_CONN_NO(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Conn = NO', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                           'Произведите настройки:\nУстановите Conn = NO\nНажмите OK')

#######################################################################################################################
###############################################   Fluke5520 SET VDC   #################################################
#######################################################################################################################
    def SET_VDC(self, verified: (str | float | int)) -> None:
        if self.IsAutomatic:
            RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: VDC = {verified}', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                           f"Произведите настройки:\nУстановите VDC = {verified}\nНажмите OK")

#######################################################################################################################
###############################################   Fluke5520 SET VAC   #################################################
#######################################################################################################################

    def SET_VAC(self, verified: (str | float | int), frequency: (str | float | int)) -> None:
        if self.IsAutomatic:
            RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: VAC = {verified} {frequency}', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                           f"Произведите настройки:\nУстановите VAC = {verified} {frequency}\nНажмите OK")

#######################################################################################################################
###############################################   Fluke5520 SET R   ###################################################
#######################################################################################################################
    def SET_R(self, verified: (str | float | int)) -> None:
        if self.IsSimulation:
            RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: R = {verified}', 'driver')
        elif self.IsAutomatic:
            RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: R = {verified}', 'driver')
            #RFSE.Driver('Fluke5000', 'set', f'R = {verified}')
        else:
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                           f"Произведите настройки:\nУстановите R = {verified}\nНажмите OK")

#######################################################################################################################
###############################################   Fluke5520 SET IDC   #################################################
#######################################################################################################################
    def SET_IDC(self, verified: (str | float | int)) -> None:
        if self.IsAutomatic:
            RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: IDC = {verified}', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                           f"Произведите настройки:\nУстановите IDC = {verified}\nНажмите OK")

#######################################################################################################################
###############################################   Fluke5520 SET IAC   #################################################
#######################################################################################################################
    def SET_IAC(self, verified: (str | float | int), frequency: (str | float | int)) -> None:
        if self.IsAutomatic:
            RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: IAC = {verified} {frequency}', 'driver')
        else:
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                           f"Произведите настройки:\nУстановите IAC = {verified} {frequency}\nНажмите OK")

#######################################################################################################################
#######################################   Fluke5520 SET SwitchOFF = Enable   ##########################################
#######################################################################################################################

    def SET_SwitchOFF_Enable(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: SwitchOFF = ENABLE', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                           'Произведите настройки:\nУстановите Stop\nНажмите OK')

#######################################################################################################################
##########################################   Fluke5520 SET SwitchOFF = DIS   ##########################################
#######################################################################################################################

    def SET_SwitchOFF_DIS(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: SwitchOFF = DIS', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                           'Произведите настройки:\nУстановите SwitchOFF = DISABLE\nНажмите OK')

#######################################################################################################################
##############################################   Fluke5520 SET STOP   #################################################
#######################################################################################################################

    def SET_STOP(self) -> None:
        if self.IsAutomatic:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Stop', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                           'Произведите настройки:\nУстановите Stop\nНажмите OK')