import time

import RFSE
import MFRT
import MOSC


class ExFluke5000Agilent34401A:
    def __init__(self) -> None:
        self.FirstScriptStart, self.ContinueMeasurement = True, True
        self.RemeasurementNumber, self.TimeDelay, self.Count_meas = 0, 0, 0
        self.WireConnection = str()
        self.Remeasurement, self.Driver_start = False, False
        self.R4FirstResult = True
        self.LowerLimitResult, self.UpperLimitResult, self.Status = None, None, None
        self.AutomaticFluke5520A, self.AutomaticAgilent34401A = False, False
        self.__init_connected_and_type_connected()

    def MeasurementAndReport(self, range, verified, error, WireConnection, frequency=None, filter=None) -> None:
        """
            Функция расчета и отчета
        """
        f_verified = MFRT.ConvertStringToFloat(verified)
        f_error = MFRT.ConvertStringToFloat(error)

#######################################################################################################################
#######################################################  VDC  #########################################################
#######################################################################################################################

        if WireConnection == 'VDC':

#######################################################################################################################
#####################################################  VDC MEAS  ######################################################
#######################################################################################################################

            RFSE.Stage(f'Измерение VDC -> диапазон = {range}, поверяемое = {verified}, погрешность = {error}')

############################################   Agilent34401A SET RANGE   ##############################################
            if self.AutomaticAgilent34401A:
                RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: range = {range}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Agilent34401A#@agilent34401a",
                               f"Произведите настройки:\nУстановите диапазон = {range}\nНажмите OK")
#######################################################################################################################

#############################################   Fluke5520A SET VDC   ##################################################
            if self.AutomaticFluke5520A:
                RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: VDC = {verified}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                               f"Произведите настройки:\nУстановите VDC = {verified}\nНажмите OK")
#######################################################################################################################

            f_result, accuracy = self.GetResultMeasurement(verified=f_verified, error=f_error)

#######################################################################################################################
####################################################  VDC REPORT  #####################################################
#######################################################################################################################

            RFSE.Report("VDC", "set", "table", f"{range};"
                                               f"{verified};"
                                               f"{MFRT.ConvertFloatToString(f_result, verified)};"
                                               f"{MFRT.ConvertFloatToString(accuracy, verified)};"
                                               f"{MFRT.ConvertFloatToString(error)};"
                                               f"{self.Status}")

#######################################################################################################################
#######################################################  VAC  #########################################################
#######################################################################################################################

        elif WireConnection == 'VAC':

#######################################################################################################################
####################################################  VAC MEAS  #######################################################
#######################################################################################################################

            RFSE.Stage(f'Измерение VAC -> диапазон = {range}, поверяемое = {verified}, фильтр = {filter}, '
                       f'частота = {frequency}, погрешность = {error}')

#############################################   Agilent34401A SET RANGE   #############################################
            if self.AutomaticAgilent34401A:
                RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: range = {range}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Agilent34401A#@agilent34401a",
                               f"Произведите настройки:\nУстановите диапазон = {range}\nНажмите OK")

#######################################################################################################################

#############################################   Fluke5520A SET VAC   ##################################################
            if self.AutomaticFluke5520A:
                RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: VAC = {verified} {frequency}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                               f"Произведите настройки:\nУстановите VAC = {verified} {frequency}\nНажмите OK")
#######################################################################################################################

            f_result, accuracy = self.GetResultMeasurement(verified=f_verified, error=f_error)

#######################################################################################################################
###################################################  VAC REPORT  ######################################################
#######################################################################################################################

            RFSE.Report("VAC", "set", "table", f"{range};"
                                               f"{verified};"
                                               f"{frequency};"
                                               f"{MFRT.ConvertFloatToString(f_result, verified)};"
                                               f"{MFRT.ConvertFloatToString(accuracy, verified)};"
                                               f"{error};"
                                               f"{self.Status}")

#######################################################################################################################
#####################################################   R2  ###########################################################
#######################################################################################################################

        elif WireConnection == 'R2':

#######################################################################################################################
####################################################  R2 MEAS  ########################################################
#######################################################################################################################

            RFSE.Stage(f'Измерение R2 -> диапазон = {range}, поверяемое = {verified}, погрешность = {error}')

############################################   Agilent34401A SET RANGE   ##############################################
            if self.AutomaticAgilent34401A:
                RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: range = {range}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Agilent34401A#@agilent34401a",
                               f"Произведите настройки:\nУстановите диапазон = {range}\nНажмите OK")
#######################################################################################################################

#############################################   Fluke5520A SET R   ####################################################
            if self.AutomaticFluke5520A:
                RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: R = {verified}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                               f"Произведите настройки:\nУстановите R = {verified}\nНажмите OK")
#######################################################################################################################

            f_result, accuracy = self.GetResultMeasurement(verified=f_verified, error=f_error)

#######################################################################################################################
###################################################  R2 REPORT  #######################################################
#######################################################################################################################

            RFSE.Report("RES", "set", "table", f"{range};"
                                               f"{verified};"
                                               f"{MFRT.ConvertFloatToString(f_result, verified)};"
                                               f"{MFRT.ConvertFloatToString(accuracy, verified)};"
                                               f"{error};"
                                               f"{self.Status}")

#######################################################################################################################
#####################################################   R4  ###########################################################
#######################################################################################################################

        elif WireConnection == 'R4':

#######################################################################################################################
#####################################################  R4 MEAS  #######################################################
#######################################################################################################################

            RFSE.Stage(f'Измерение R4 -> диапазон = {range}, поверяемое = {verified}, погрешность = {error}')
            
            if self.R4FirstResult:
############################################   Fluke5520A SET R = 0   #################################################
                if self.AutomaticFluke5520A:
                    RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: R = 0', 'driver')            
                else:
                    RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                                   "Произведите настройки:\nУстановите R = 0\nНажмите OK")
#######################################################################################################################
            
                RFSE.Messenger('set', 'Произведите настройки#@attention',
                               'Установите разрешение до 4-го знака после запятой;\n'
                               'Обнулите мультиметр, если это необходимо;\n'
                               'Нажмите OK')
            
                self.R4FirstResult = False

############################################   Agilent34401A SET RANGE   ##############################################
            if self.AutomaticAgilent34401A:
                RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: range = {range}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Agilent34401A#@agilent34401a",
                               f"Произведите настройки:\nУстановите диапазон = {range}\nНажмите OK")
#######################################################################################################################

#############################################   Fluke5520A SET R4  ###################################################

            if self.AutomaticFluke5520A:
                RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: R = {verified}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                               f"Произведите настройки:\nУстановите R = {verified}\nНажмите OK")
#######################################################################################################################

            f_result, accuracy = self.GetResultMeasurement(verified=f_verified, error=f_error)

#######################################################################################################################
##############################################  R4 REPORT  ############################################################
#######################################################################################################################

            RFSE.Report("RES", "set", "table", f"{range};"
                                               f"{verified};"
                                               f"{MFRT.ConvertFloatToString(f_result, verified)};"
                                               f"{MFRT.ConvertFloatToString(accuracy, verified)};"
                                               f"{error};"
                                               f"{self.Status}")

#######################################################################################################################
#######################################################  IDC  #########################################################
#######################################################################################################################

        elif WireConnection == 'IDC':

#######################################################################################################################
#####################################################  IDC MEAS  ######################################################
#######################################################################################################################

            RFSE.Stage(f'Измерение IDC -> диапазон = {range}, поверяемое = {verified}, погрешность = {error}')

############################################   Agilent34401A SET RANGE   ##############################################
            if self.AutomaticAgilent34401A:
                RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: range = {range}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Agilent34401A#@agilent34401a",
                               f"Произведите настройки:\nУстановите диапазон = {range}\nНажмите OK")
#######################################################################################################################

#############################################   Fluke5520A SET IDC   ##################################################

            if self.AutomaticFluke5520A:
                RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: IDC = {verified}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                               f"Произведите настройки:\nУстановите IDC = {verified}\nНажмите OK")
#######################################################################################################################

            f_result, accuracy = self.GetResultMeasurement(verified=f_verified, error=f_error)

#######################################################################################################################
####################################################  IDC REPORT  #####################################################
#######################################################################################################################

            RFSE.Report("IDC", "set", "table", f"{range};"
                                               f"{verified};"
                                               f"{MFRT.ConvertFloatToString(f_result, verified)};"
                                               f"{MFRT.ConvertFloatToString(accuracy, verified)};"
                                               f"{error};"
                                               f"{self.Status}")

#######################################################################################################################
#######################################################  IAC  #########################################################
#######################################################################################################################

        elif WireConnection == 'IAC':

#######################################################################################################################
#####################################################  IAC MEAS  ######################################################
#######################################################################################################################

            RFSE.Stage(f'Измерение IAC -> диапазон = {range}, поверяемое = {verified}, фильтр = {filter}, '
                       f'частота = {frequency}, погрешность = {error}')

############################################   Agilent34401A SET RANGE   ##############################################
            if self.AutomaticAgilent34401A:
                RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: range = {range}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Agilent34401A#@agilent34401a",
                               f"Произведите настройки:\nУстановите диапазон = {range}\nНажмите OK")
#######################################################################################################################

#############################################   Fluke5520A SET IAC   ##################################################

            if self.AutomaticFluke5520A:
                RFSE.Stage(f'Драйвер: Fluke5000 >> режим: set >> команда: IAC = {verified} {frequency}', 'driver')
            else:
                RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a",
                               f"Произведите настройки:\nУстановите IAC = {verified} {frequency}\nНажмите OK")
#######################################################################################################################

            f_result, accuracy = self.GetResultMeasurement(verified=f_verified, error=f_error)

#######################################################################################################################
###################################################  IAC REPORT  ######################################################
#######################################################################################################################

            RFSE.Report("IAC", "set", "table", f"{range};"
                                               f"{verified};"
                                               f"{frequency};"
                                               f"{MFRT.ConvertFloatToString(f_result, verified)};"
                                               f"{MFRT.ConvertFloatToString(accuracy, verified)};"
                                               f"{error};"
                                               f"{self.Status}")

#######################################################################################################################
#######################################################################################################################
########################################  Function get result measuare   ##############################################
#######################################################################################################################
#######################################################################################################################

    def GetResultMeasurement(self, verified, error) -> (float, float):
        f_result, accuracy = 0, 0
        while self.ContinueMeasurement:

            time.sleep(self.TimeDelay)
############################################   Agilent34401A READ RESULT    ###########################################
            if self.AutomaticAgilent34401A:
                RFSE.Stage(f'Драйвер: AgilentDMM >> режим: get >> команда: result = read', 'driver')
                result = verified
            else:
                result = RFSE.Messenger("get", "Введите результат#@notes",
                                        "Введите измеренный результат с Agilent34401A\nНажмите OK", "string")
            RFSE.Stage(" ")
#######################################################################################################################

            f_result = MFRT.ConvertStringToFloat(result)
            if isinstance(f_result, str):
                continue
            accuracy = abs(verified - f_result)
            if accuracy > error and self.Remeasurement:
                if self.Count_meas >= self.RemeasurementNumber - 1:
                    choices = self.CallMessengerChoices(
                        verified=verified, error=error, result=f_result, reference_number=verified)
                    if choices:
                        continue
                else:
                    self.CallMessengerErrorPoint(
                        verified=verified, error=error, result=f_result, reference_number=verified)
                    continue
            else:
                if accuracy > error:
                    self.Status = 'Не годен'
                else:
                    self.Status = 'Годен'
                self.Count_meas = 0

            self.ContinueMeasurement = False
        return f_result, accuracy

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def MeasurementStartCommand(self, WireConnection: str) -> None:
        if not self.Driver_start:

############################################   Agilent34401A SET FUNC   ###############################################
            if self.AutomaticAgilent34401A:
                RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: func = {WireConnection} ', 'driver')
            else:
                RFSE.Messenger('set', 'Произведите настройки на Agilent34401A#@agilent34401a',
                               f'Произведите настройки:\nУстановите func = {WireConnection}\nНажмите OK')
#######################################################################################################################

############################################   Agilent34401A SET NPLC   ###############################################
            if WireConnection not in ['IAC', 'VAC']:
                if self.AutomaticAgilent34401A:
                    RFSE.Stage(f'Драйвер: AgilentDMM >> режим: set >> команда: NPLC = 100 ', 'driver')
                else:
                    RFSE.Messenger('set', 'Произведите настройки на Agilent34401A#@agilent34401a',
                                   f'Произведите настройки:\nУстановите NPLC = 100\nНажмите OK')
#######################################################################################################################

            if WireConnection in ['IDC', 'IAC', 'VAC']:
                if self.AutomaticAgilent34401A:
                    if WireConnection != "IDC":
                        RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: BAND = MIN ', 'driver')
                    RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: NPLC = MAX ', 'driver')
                else:
                    body_message = 'Установите фильтр на 3 Гц;\n' if WireConnection != 'IDC' else ''
                    RFSE.Messenger('set', 'Произведите настройки#@attention',
                                   'Установите разрешение = 6.5;\n' + body_message + 'Нажмите OK')

############################################   Fluke5520 SET OUT = AUX   ##############################################
            if WireConnection in ['IDC', 'IAC']:
                if self.AutomaticFluke5520A:
                    RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: OUT = AUX', 'driver')
                else:
                    RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                                   f'Произведите настройки:\nУстановите OUT = AUX\nНажмите OK')
#######################################################################################################################

###########################################   Fluke5520 SET OUT = NORMAL  #############################################
            elif WireConnection != 'R2':
                if self.AutomaticFluke5520A:
                    RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: OUT = NORMAL', 'driver')
                else:
                    RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                                   f'Произведите настройки:\nУстановите OUT = NORMAL\nНажмите OK')
#######################################################################################################################

############################################   Fluke5520 SET Conn = 4w  ###############################################
            if WireConnection == 'R4':
                if self.AutomaticFluke5520A:
                    RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Conn = 4w', 'driver')
                else:
                    RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                                   f'Произведите настройки:\nУстановите Conn = 4w\nНажмите OK')
#######################################################################################################################

############################################   Fluke5520 SET Conn = NO  ###############################################
            elif WireConnection == 'R2':
                if self.AutomaticFluke5520A:
                    RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Conn = NO', 'driver')
                else:
                    RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                                   f'Произведите настройки:\nУстановите Conn = NO\nНажмите OK')
#######################################################################################################################

##########################################   Fluke5520 SET SwitchOFF = DIS   ##########################################
            if self.AutomaticFluke5520A:
                RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: SwitchOFF = DIS', 'driver')
            else:
                RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                               f'Произведите настройки:\nУстановите SwitchOFF = DISABLE\nНажмите OK')
#######################################################################################################################

            RFSE.Stage(" ")
            self.Driver_start = True

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def MeasurementStopCommand(self) -> None:

########################################   Fluke5520 SET SwitchOFF = ENABLE   #########################################
###############################################   Fluke5520 SET Stop  #################################################
        if self.AutomaticFluke5520A:
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: SwitchOFF = ENABLE', 'driver')
            RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Stop', 'driver')
        else:
            RFSE.Messenger('set', 'Произведите настройки на Fluke5520A#@fluke5520a',
                           f'Произведите настройки:\nУстановите SwitchOFF = ENABLE\nУстановите Stop\nНажмите OK')
#######################################################################################################################

        self.Driver_start = False


#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def CheckWireConnection(self, WireConnection: str) -> None:
        self.ContinueMeasurement = True
        if self.WireConnection not in ['VDC', 'VAC', 'R2']:
            if WireConnection == 'VDC':
                RFSE.Messenger('set',
                               'Подключение проводов#FLUKE5520A_AGILENT34401A_V_R2.png',
                               'Подключите мультиметр к калибратору для проверки напряжения VDC.\n'
                               'Выход калибратора NORMAL')
            elif WireConnection == 'VAC':
                RFSE.Messenger('set',
                               'Подключение проводов#FLUKE5520A_AGILENT34401A_V_R2.png',
                               'Подключите мультиметр к калибратору для проверки напряжения VAC.\n'
                               'Выход калибратора NORMAL')
            elif WireConnection == 'R2':
                RFSE.Messenger('set',
                               'Подключение проводов#FLUKE5520A_AGILENT34401A_V_R2.png',
                               'Подключите мультиметр к калибратору для проверки сопротивления R2.\n'
                               'Выход калибратора NORMAL')
        if self.WireConnection not in ['IDC', 'IAC']:
            if WireConnection == 'IDC':
                RFSE.Messenger("set",
                               'Подключение проводов#FLUKE5520A_AGILENT34401A_I.png',
                               'Подключите мультиметр к калибратору для проверки.\n'
                               'Постоянный ток IDC до 3 А.\n'
                               'Выход калибратора AUX до 2 А.')
            elif WireConnection == 'IAC':
                RFSE.Messenger("set",
                               'Подключение проводов#FLUKE5520A_AGILENT34401A_I.png',
                               'Подключите мультиметр к калибратору для проверки.\n'
                               'Переменный ток IAC до 3 А.\n'
                               'Выход калибратора AUX до 2 А.')

        if self.WireConnection not in ['R4']:
            if WireConnection == 'R4':     RFSE.Messenger('set',
                                                          'Подключение проводов#FLUKE5520A_AGILENT34401A_R4.png',
                                                          'Подключите мультиметр к калибратору для проверки.\n'
                                                          'Сопротивление RES в 4-х проводной схеме.')

        self.WireConnection = WireConnection
        RFSE.Stage(' ')

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def CheckConnectDevices(self) -> None:
        if self.FirstScriptStart:
            RFSE.Stage('*****************************************************')
            RFSE.Stage('***************** Подключение устройств *******************')
            RFSE.Stage('*****************************************************')

            self.InitializationAGILENT34401A(init=False)
            self.InitializationFluke5520A(init=False)

            self.FirstScriptStart = False

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def InitializationAGILENT34401A(self, init=True):

        type_setting_agilent = RFSE.Messenger("get", "Выберите способ подключения AGILENT34401A#@agilent34401a",
                                                     "Пожалуйста, выберите тип настройки прибора Agilent34401A",
                                                     "choice=Автоматически;Вручную")

        RFSE.Stage(" ")

        RFSE.Report("TYPE_SETTING_AGILENT34401A", "info", "string", "Тип настройки прибора")

############################################   AGILENT34401A Init   ###################################################
#########################################   AGILENT34401A SET Timeout  ################################################
##########################################   AGILENT34401A SET Reset  #################################################
        if type_setting_agilent == 'Автоматически':

            choices = None

            RFSE.Stage('Драйвер: AgilentDMM >> режим: init >> команда: ', 'driver')
            agilent3401a_status = 'connected'

            if agilent3401a_status != 'connected':
                choices = RFSE.Messenger("get", "Инициализация AGILENT34401A не удалась#@agilent34401a",
                                         "Не удалось инициализировать AGILENT34401A. Вы хотите продолжить измерение в "
                                         "ручном режиме?", "boolean")

            if not choices or agilent3401a_status == 'connected':
                self.AutomaticAgilent34401A = True
                RFSE.Report("TYPE_SETTING_AGILENT34401A", "set", 'string', 'Автоматически')
                RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: Timeout = 10000', 'driver')
                RFSE.Stage('Драйвер: AgilentDMM >> режим: set >> команда: Reset', 'driver')
            else:
                type_setting_agilent = 'Вручную'

        if type_setting_agilent == 'Вручную':
            RFSE.Report("TYPE_SETTING_AGILENT34401A", "set", 'string', 'Вручную')
            self.AutomaticAgilent34401A = False
            RFSE.Messenger("set", "Произведите настройки Agilent34401A#@agilent34401a", "Произведите настройки:\n"
                                                                                "Включите прибор\n"
                                                                                "Установите Timeout = 10000\n"
                                                                                "Выполните сброс\n"
                                                                                "Нажмите OK")

#######################################################################################################################

        if init:
            if self.AutomaticAgilent34401A:
                MOSC.hash_passed()
            else:
                MOSC.hash_failed()

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def InitializationFluke5520A(self, init=True):

        type_setting_fluke = RFSE.Messenger("get", "Выберите способ подключения FLUKE5520A#@fluke5520a",
                                                   "Пожалуйста, выберите тип настройки прибора FLUKE5520",
                                                   "choice=Автоматически;Вручную")

        RFSE.Stage(" ")

        RFSE.Report("TYPE_SETTING_FLUKE5520A", "info", "string", "Тип настройки прибора")

###################################################   Fluke5520 Init   ################################################
###############################################   Fluke5520 SET Timeout  ##############################################
################################################   Fluke5520 SET Reset  ###############################################

        if type_setting_fluke == 'Автоматически':

            choices = None

            RFSE.Stage('Драйвер: Fluke5000 >> режим: init >> команда: ', 'driver')
            fluke_5520a_status = 'connected'

            if fluke_5520a_status != 'connected':
                choices = RFSE.Messenger("get", "Инициализация Fluke5520A не удалась#@fluke5520a",
                                         "Не удалось инициализировать Fluke5520A. Вы хотите продолжить измерение в "
                                         "ручном режиме?", "boolean")
            if not choices or fluke_5520a_status == 'connected':

                self.AutomaticFluke5520A = True

                RFSE.Report("TYPE_SETTING_FLUKE5520A", "set", "string", "Автоматически")
                RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Timeout = 10000', 'driver')
                RFSE.Stage('Драйвер: Fluke5000 >> режим: set >> команда: Reset', 'driver')
            else:
                type_setting_fluke = 'Вручную'

        if type_setting_fluke == 'Вручную':
            RFSE.Report("TYPE_SETTING_FLUKE5520A", "set", "string", "Вручную")
            self.AutomaticFluke5520A = False
            RFSE.Messenger("set", "Произведите настройки на Fluke5520A#@fluke5520a", "Произведите настройки:\n"
                                                                             "Включите прибор\n"
                                                                             "Установите Timeout = 10000\n"
                                                                             "Выполните сброс\n"
                                                                             "Нажмите OK")


#######################################################################################################################
        if init:
            if self.AutomaticFluke5520A:
                MOSC.hash_passed()
            else:
                MOSC.hash_failed()

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def SettingMeasurementLimits(self, verified, error) -> None:
        self.LowerLimitResult = verified - error
        self.UpperLimitResult = verified + error

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def CallMessengerChoices(self, verified, error, result, reference_number) -> str:
        self.SettingMeasurementLimits(verified=verified, error=error)

        limit_type = "нижний" if self.LowerLimitResult > result else "верхний"
        limit_value = self.LowerLimitResult - result if limit_type == "нижний" else result - self.UpperLimitResult

        error_message = 'Вы хотите повторить измерение этой точки?\n'
        error_message += f'Нижний предел < Результат < Верхний предел\n'
        error_message += f'{MFRT.ConvertFloatToString(self.LowerLimitResult, reference_number)} < '
        error_message += f'{MFRT.ConvertFloatToString(result, reference_number)} < '
        error_message += f'{MFRT.ConvertFloatToString(self.UpperLimitResult, reference_number)}\n'
        error_message += f'Измерение не соответствует {limit_type} пределу ' \
                         f'на {MFRT.ConvertFloatToString(limit_value, reference_number)}'

        choices = RFSE.Messenger('get', 'Результат измерения не прошел указанный предел#@repeat',
                                 error_message, 'boolean')

        self.Status = "Не годен"
        self.Count_meas = 0
        return choices

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def CallMessengerErrorPoint(self, verified, error, result, reference_number) -> None:
        self.SettingMeasurementLimits(verified=verified, error=error)

        limit_type = "нижний" if self.LowerLimitResult > result else "верхний"
        limit_value = self.LowerLimitResult - result if limit_type == "нижний" else result - self.UpperLimitResult

        error_message = 'Результат измерения не прошел указанный предел\n'
        error_message += 'Значение переизмеряется\n'
        error_message += f'Нижний предел <  Результат < Верхний предел\n'
        error_message += f'{MFRT.ConvertFloatToString(self.LowerLimitResult, reference_number)} < '
        error_message += f'{MFRT.ConvertFloatToString(result, reference_number)} < '
        error_message += f'{MFRT.ConvertFloatToString(self.UpperLimitResult, reference_number)}\n'
        error_message += f'Измерение не соответствует {limit_type} пределу ' \
                         f'на {MFRT.ConvertFloatToString(limit_value, reference_number)}'

        RFSE.Messenger('set', 'Измерение не удалось#@failed', error_message, delaytime='5')
        self.Count_meas += 1

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    @staticmethod
    def LoadTablesHeadInfo() -> None:
        RFSE.Report('VDC', 'info', 'table', "Диапазон#100;"
                                            "Точка#100;"
                                            "Результат#100;"
                                            "Точность#100;"
                                            "Допустимая погрешность#100;"
                                            "Заключение#100;")

        RFSE.Report('VAC', 'info', 'table', "Диапазон#100;"
                                            "Точка#100;"
                                            "Частота#100;"
                                            "Результат#100;"
                                            "Точность#100;"
                                            "Допустимая погрешность#100;"
                                            "Заключение#100;")

        RFSE.Report('RES', 'info', 'table', "Диапазон#100;"
                                            "Точка#100;"
                                            "Результат#100;"
                                            "Точность#100;"
                                            "Допустимая погрешность#100;"
                                            "Заключение#100;")

        RFSE.Report('IDC', 'info', 'table', "Диапазон#100;"
                                            "Точка#100;"
                                            "Результат#100;"
                                            "Точность#100;"
                                            "Допустимая погрешность#100;"
                                            "Заключение#100;")

        RFSE.Report('IAC', 'info', 'table', "Диапазон#100;"
                                            "Точка#100;"
                                            "Частота#100;"
                                            "Результат#100;"
                                            "Точность#100;"
                                            "Допустимая погрешность#100;"
                                            "Заключение#100;")
        RFSE.Stage(" ")

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

    def __init_connected_and_type_connected(self):
        type_setting_Fluke5520A = RFSE.Report("TYPE_SETTING_FLUKE5520A", "get", "string", "", 'string')
        type_setting_Agilent34401A = RFSE.Report("TYPE_SETTING_AGILENT34401A", "get", "string", "", 'string')

        if len(type_setting_Agilent34401A) == 0 or len(type_setting_Fluke5520A) == 0:
            self.FirstScriptStart = True
            return 
        else:
            self.FirstScriptStart = False

        if type_setting_Fluke5520A.lower() == 'автоматически':
            self.AutomaticFluke5520A = True
        else:
            self.AutomaticFluke5520A = False

        if type_setting_Agilent34401A.lower() == 'автоматически':
            self.AutomaticAgilent34401A = True
        else:
            self.AutomaticAgilent34401A = False

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################


Poverka = ExFluke5000Agilent34401A()
